#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.kubernetes.module.infinity-gauntlet.module.services.module.default-backend.helm_release.default-backend: Refreshing state... [id=default-backend]
module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211002221308236500000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211002221308264400000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211002220839237300000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211002221308264300000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211002220839212500000002]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211002220839194800000001]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "tftp-netboot-infinity-gauntlet-20211002221308264400000003"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-etcd-20211002221308264300000002"
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-longhorn-20211002221308236500000001"
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
        name   = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListAllMyBuckets",
                            "s3:GetBucketLocation",
                          + "s3:ListAllMyBuckets",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20211002221308264300000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211002221308236500000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211002221308264400000003" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"] will be updated in-place
  ~ resource "kubernetes_manifest" "runner_deployment_autoscaler" {
      ~ manifest = {
          ~ spec       = {
              ~ maxReplicas    = 2 -> 1024
                # (3 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ maxReplicas                        = 2 -> 1024
              ~ minReplicas                        = 1 -> 0
                # (6 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.helm_release.pi-hole-exporter will be created
  + resource "helm_release" "pi-hole-exporter" {
      + atomic                     = true
      + chart                      = "pi-hole-exporter"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "pi-hole-exporter"
      + namespace                  = "pi-hole-exporter"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.wyrihaximus.net/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "0.1.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "replicas"
          + value = "2"
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_namespace.namespace will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "pi-hole-exporter"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_secret.configuration will be created
  + resource "kubernetes_secret" "configuration" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "pi-hole"
          + namespace        = "pi-hole-exporter"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 6 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>